In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
index = pd.date_range('1/1/2024', periods = 8) # 날짜 생성
index

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
index = pd.date_range('1/1/2024', periods = 8)
df = pd.DataFrame(  np.random.rand(8,3),  # 난수 생성
                    index = index,  # 날짜 설정
                    columns= list('ABC'))  # 컬럼 설정
df

                   A         B         C
2024-01-01  0.186506  0.194537  0.041806
2024-01-02  0.708895  0.797353  0.343832
2024-01-03  0.052170  0.257694  0.397988
2024-01-04  0.386758  0.022835  0.946291
2024-01-05  0.871056  0.405117  0.939412
2024-01-06  0.421549  0.001294  0.946909
2024-01-07  0.327523  0.724930  0.187902
2024-01-08  0.606071  0.154689  0.669974

In [9]:
index = pd.date_range('1/1/2024', periods = 8)
df = pd.DataFrame(  np.random.rand(8,3),  # 난수 생성
                    index = index,  # 날짜 설정
                    columns= list('ABC'))
df['B']

2024-01-01    0.406467
2024-01-02    0.553441
2024-01-03    0.594702
2024-01-04    0.671883
2024-01-05    0.995166
2024-01-06    0.955980
2024-01-07    0.585497
2024-01-08    0.538332
Freq: D, Name: B, dtype: float64

In [10]:
df['B'][0]

C:\Users\parks\AppData\Local\Temp\ipykernel_17624\2498547084.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df['B'][0]

np.float64(0.40646677579457846)

In [12]:
index = pd.date_range('1/1/2000', periods= 8)

df = pd.DataFrame(np.random.rand(8,3), index = index, columns = ['A', 'B', 'C'])
print(df['B'] > 0.4)

df2 = df[df['B'] > 0.4]
print(df2)

2000-01-01     True
2000-01-02    False
2000-01-03    False
2000-01-04    False
2000-01-05     True
2000-01-06    False
2000-01-07     True
2000-01-08     True
Freq: D, Name: B, dtype: bool
                   A         B         C
2000-01-01  0.592407  0.591168  0.864115
2000-01-05  0.393648  0.724935  0.158073
2000-01-07  0.195306  0.860540  0.644668
2000-01-08  0.131415  0.892928  0.018100

In [14]:
df2.T

   2000-01-01  2000-01-05  2000-01-07  2000-01-08
A    0.592407    0.393648    0.195306    0.131415
B    0.591168    0.724935    0.860540    0.892928
C    0.864115    0.158073    0.644668    0.018100

In [15]:
df.T

,2000-01-01,2000-01-02,2000-01-03,2000-01-04,2000-01-05,2000-01-06,2000-01-07,2000-01-08
A,0.592407,0.396438,0.421968,0.302417,0.393648,0.692493,0.195306,0.131415
B,0.591168,0.035436,0.137565,0.381008,0.724935,0.353126,0.860540,0.892928
C,0.864115,0.532765,0.688546,0.655805,0.158073,0.490231,0.644668,0.018100

In [16]:
df['D'] = df['A'] / df['B'] 
df

                   A         B         C          D
2000-01-01  0.592407  0.591168  0.864115   1.002096
2000-01-02  0.396438  0.035436  0.532765  11.187349
2000-01-03  0.421968  0.137565  0.688546   3.067421
2000-01-04  0.302417  0.381008  0.655805   0.793729
2000-01-05  0.393648  0.724935  0.158073   0.543011
2000-01-06  0.692493  0.353126  0.490231   1.961035
2000-01-07  0.195306  0.860540  0.644668   0.226957
2000-01-08  0.131415  0.892928  0.018100   0.147173

In [20]:
df['E'] = np.sum(df, axis = 1) # axis = 0은 행 1은 열
df

                   A         B         C          D          E
2000-01-01  0.592407  0.591168  0.864115   1.002096   6.099573
2000-01-02  0.396438  0.035436  0.532765  11.187349  24.303975
2000-01-03  0.421968  0.137565  0.688546   3.067421   8.631001
2000-01-04  0.302417  0.381008  0.655805   0.793729   4.265919
2000-01-05  0.393648  0.724935  0.158073   0.543011   3.639336
2000-01-06  0.692493  0.353126  0.490231   1.961035   6.993771
2000-01-07  0.195306  0.860540  0.644668   0.226957   3.854943
2000-01-08  0.131415  0.892928  0.018100   0.147173   2.379232

In [21]:
df['F'] = np.ones(8)
df.head(3)

                   A         B         C          D          E    F
2000-01-01  0.592407  0.591168  0.864115   1.002096   6.099573  1.0
2000-01-02  0.396438  0.035436  0.532765  11.187349  24.303975  1.0
2000-01-03  0.421968  0.137565  0.688546   3.067421   8.631001  1.0

In [22]:
df1 = df.drop(['E', 'F'], axis = 1)
df1.head()

                   A         B         C          D
2000-01-01  0.592407  0.591168  0.864115   1.002096
2000-01-02  0.396438  0.035436  0.532765  11.187349
2000-01-03  0.421968  0.137565  0.688546   3.067421
2000-01-04  0.302417  0.381008  0.655805   0.793729
2000-01-05  0.393648  0.724935  0.158073   0.543011

In [23]:
del df1['D']
df1.head()

                   A         B         C
2000-01-01  0.592407  0.591168  0.864115
2000-01-02  0.396438  0.035436  0.532765
2000-01-03  0.421968  0.137565  0.688546
2000-01-04  0.302417  0.381008  0.655805
2000-01-05  0.393648  0.724935  0.158073

In [28]:
df1.columns = ['a', 'b', 'c']
df1.rename(columns= {'a': '2020', 'b': '2021'}, inplace=True)
df1.tail()

                2020      2021         c
2000-01-04  0.302417  0.381008  0.655805
2000-01-05  0.393648  0.724935  0.158073
2000-01-06  0.692493  0.353126  0.490231
2000-01-07  0.195306  0.860540  0.644668
2000-01-08  0.131415  0.892928  0.018100

In [29]:
df1 = df1.sub(df1['2020'], axis = 'index')
df1.tail()

            2020      2021         c
2000-01-04   0.0  0.078591  0.353388
2000-01-05   0.0  0.331287 -0.235575
2000-01-06   0.0 -0.339367 -0.202262
2000-01-07   0.0  0.665234  0.449363
2000-01-08   0.0  0.761513 -0.113315